Blinkinlabs/EightByEight/bootloader/mk20dn64.h
// Chapter 33: Programmable Delay Block (PDB)
#define PDB0_SC                 *(volatile uint32_t *)0x40036000 // Status and Control Register
#define PDB_SC_LDMOD(n)         (((n) & 3) << 18)   // Load Mode Select
#define PDB_SC_PDBEIE           0x00020000      // Sequence Error Interrupt Enable
#define PDB_SC_SWTRIG           0x00010000      // Software Trigger
#define PDB_SC_DMAEN            0x00008000      // DMA Enable
#define PDB_SC_PRESCALER(n)     (((n) & 7) << 12)   // Prescaler Divider Select
#define PDB_SC_TRGSEL(n)        (((n) & 15) << 8)   // Trigger Input Source Select
#define PDB_SC_PDBEN            0x00000080      // PDB Enable
#define PDB_SC_PDBIF            0x00000040      // PDB Interrupt Flag
#define PDB_SC_PDBIE            0x00000020      // PDB Interrupt Enable.
#define PDB_SC_MULT(n)          (((n) & 3) << 2)    // Multiplication Factor
#define PDB_SC_CONT         0x00000002      // Continuous Mode Enable
#define PDB_SC_LDOK         0x00000001      // Load OK
#define PDB0_MOD                *(volatile uint32_t *)0x40036004 // Modulus Register
#define PDB0_CNT                *(volatile uint32_t *)0x40036008 // Counter Register
#define PDB0_IDLY               *(volatile uint32_t *)0x4003600C // Interrupt Delay Register
#define PDB0_CH0C1              *(volatile uint32_t *)0x40036010 // Channel n Control Register 1
#define PDB0_CH0S               *(volatile uint32_t *)0x40036014 // Channel n Status Register
#define PDB0_CH0DLY0            *(volatile uint32_t *)0x40036018 // Channel n Delay 0 Register
#define PDB0_CH0DLY1            *(volatile uint32_t *)0x4003601C // Channel n Delay 1 Register
#define PDB0_POEN               *(volatile uint32_t *)0x40036190 // Pulse-Out n Enable Register
#define PDB0_PO0DLY             *(volatile uint32_t *)0x40036194 // Pulse-Out n Delay Register
#define PDB0_PO1DLY             *(volatile uint32_t *)0x40036198 // Pulse-Out n Delay Register

// Chapter 34: FlexTimer Module (FTM)
#define FTM0_SC                 *(volatile uint32_t *)0x40038000 // Status And Control
#define FTM_SC_TOF          0x80                // Timer Overflow Flag
#define FTM_SC_TOIE         0x40                // Timer Overflow Interrupt Enable
#define FTM_SC_CPWMS            0x20                // Center-Aligned PWM Select
#define FTM_SC_CLKS(n)          (((n) & 3) << 3)        // Clock Source Selection
#define FTM_SC_PS(n)            (((n) & 7) << 0)        // Prescale Factor Selection
#define FTM0_CNT                *(volatile uint32_t *)0x40038004 // Counter
#define FTM0_MOD                *(volatile uint32_t *)0x40038008 // Modulo
#define FTM0_C0SC       *(volatile uint32_t *)0x4003800C // Channel 0 Status And Control
#define FTM0_C0V        *(volatile uint32_t *)0x40038010 // Channel 0 Value
#define FTM0_C1SC       *(volatile uint32_t *)0x40038014 // Channel 1 Status And Control
#define FTM0_C1V        *(volatile uint32_t *)0x40038018 // Channel 1 Value
#define FTM0_C2SC       *(volatile uint32_t *)0x4003801C // Channel 2 Status And Control
#define FTM0_C2V        *(volatile uint32_t *)0x40038020 // Channel 2 Value
#define FTM0_C3SC       *(volatile uint32_t *)0x40038024 // Channel 3 Status And Control
#define FTM0_C3V        *(volatile uint32_t *)0x40038028 // Channel 3 Value
#define FTM0_C4SC       *(volatile uint32_t *)0x4003802C // Channel 4 Status And Control
#define FTM0_C4V        *(volatile uint32_t *)0x40038030 // Channel 4 Value
#define FTM0_C5SC       *(volatile uint32_t *)0x40038034 // Channel 5 Status And Control
#define FTM0_C5V        *(volatile uint32_t *)0x40038038 // Channel 5 Value
#define FTM0_C6SC       *(volatile uint32_t *)0x4003803C // Channel 6 Status And Control
#define FTM0_C6V        *(volatile uint32_t *)0x40038040 // Channel 6 Value
#define FTM0_C7SC       *(volatile uint32_t *)0x40038044 // Channel 7 Status And Control
#define FTM0_C7V        *(volatile uint32_t *)0x40038048 // Channel 7 Value
#define FTM0_CNTIN              *(volatile uint32_t *)0x4003804C // Counter Initial Value
#define FTM0_STATUS             *(volatile uint32_t *)0x40038050 // Capture And Compare Status
#define FTM0_MODE               *(volatile uint32_t *)0x40038054 // Features Mode Selection
#define FTM_MODE_FAULTIE        0x80                // Fault Interrupt Enable
#define FTM_MODE_FAULTM(n)      (((n) & 3) << 5)        // Fault Control Mode
#define FTM_MODE_CAPTEST        0x10                // Capture Test Mode Enable
#define FTM_MODE_PWMSYNC        0x08                // PWM Synchronization Mode
#define FTM_MODE_WPDIS          0x04                // Write Protection Disable
#define FTM_MODE_INIT           0x02                // Initialize The Channels Output
#define FTM_MODE_FTMEN          0x01                // FTM Enable
#define FTM0_SYNC               *(volatile uint32_t *)0x40038058 // Synchronization
#define FTM_SYNC_SWSYNC         0x80                // 
#define FTM_SYNC_TRIG2          0x40                // 
#define FTM_SYNC_TRIG1          0x20                // 
#define FTM_SYNC_TRIG0          0x10                // 
#define FTM_SYNC_SYNCHOM        0x08                // 
#define FTM_SYNC_REINIT         0x04                // 
#define FTM_SYNC_CNTMAX         0x02                // 
#define FTM_SYNC_CNTMIN         0x01                // 
#define FTM0_OUTINIT            *(volatile uint32_t *)0x4003805C // Initial State For Channels Output
#define FTM0_OUTMASK            *(volatile uint32_t *)0x40038060 // Output Mask
#define FTM0_COMBINE            *(volatile uint32_t *)0x40038064 // Function For Linked Channels
#define FTM0_DEADTIME           *(volatile uint32_t *)0x40038068 // Deadtime Insertion Control
#define FTM0_EXTTRIG            *(volatile uint32_t *)0x4003806C // FTM External Trigger
#define FTM0_POL                *(volatile uint32_t *)0x40038070 // Channels Polarity
#define FTM0_FMS                *(volatile uint32_t *)0x40038074 // Fault Mode Status
#define FTM0_FILTER             *(volatile uint32_t *)0x40038078 // Input Capture Filter Control
#define FTM0_FLTCTRL            *(volatile uint32_t *)0x4003807C // Fault Control
#define FTM0_QDCTRL             *(volatile uint32_t *)0x40038080 // Quadrature Decoder Control And Status
#define FTM0_CONF               *(volatile uint32_t *)0x40038084 // Configuration
#define FTM0_FLTPOL             *(volatile uint32_t *)0x40038088 // FTM Fault Input Polarity
#define FTM0_SYNCONF            *(volatile uint32_t *)0x4003808C // Synchronization Configuration
#define FTM0_INVCTRL            *(volatile uint32_t *)0x40038090 // FTM Inverting Control
#define FTM0_SWOCTRL            *(volatile uint32_t *)0x40038094 // FTM Software Output Control
#define FTM0_PWMLOAD            *(volatile uint32_t *)0x40038098 // FTM PWM Load
#define FTM1_SC                 *(volatile uint32_t *)0x40039000 // Status And Control
#define FTM1_CNT                *(volatile uint32_t *)0x40039004 // Counter
#define FTM1_MOD                *(volatile uint32_t *)0x40039008 // Modulo
#define FTM1_C0SC       *(volatile uint32_t *)0x4003900C // Channel 0 Status And Control
#define FTM1_C0V        *(volatile uint32_t *)0x40039010 // Channel 0 Value
#define FTM1_C1SC       *(volatile uint32_t *)0x40039014 // Channel 1 Status And Control
#define FTM1_C1V        *(volatile uint32_t *)0x40039018 // Channel 1 Value
#define FTM1_CNTIN              *(volatile uint32_t *)0x4003904C // Counter Initial Value
#define FTM1_STATUS             *(volatile uint32_t *)0x40039050 // Capture And Compare Status
#define FTM1_MODE               *(volatile uint32_t *)0x40039054 // Features Mode Selection
#define FTM1_SYNC               *(volatile uint32_t *)0x40039058 // Synchronization
#define FTM1_OUTINIT            *(volatile uint32_t *)0x4003905C // Initial State For Channels Output
#define FTM1_OUTMASK            *(volatile uint32_t *)0x40039060 // Output Mask
#define FTM1_COMBINE            *(volatile uint32_t *)0x40039064 // Function For Linked Channels
#define FTM1_DEADTIME           *(volatile uint32_t *)0x40039068 // Deadtime Insertion Control
#define FTM1_EXTTRIG            *(volatile uint32_t *)0x4003906C // FTM External Trigger
#define FTM1_POL                *(volatile uint32_t *)0x40039070 // Channels Polarity
#define FTM1_FMS                *(volatile uint32_t *)0x40039074 // Fault Mode Status
#define FTM1_FILTER             *(volatile uint32_t *)0x40039078 // Input Capture Filter Control
#define FTM1_FLTCTRL            *(volatile uint32_t *)0x4003907C // Fault Control
#define FTM1_QDCTRL             *(volatile uint32_t *)0x40039080 // Quadrature Decoder Control And Status
#define FTM1_CONF               *(volatile uint32_t *)0x40039084 // Configuration
#define FTM1_FLTPOL             *(volatile uint32_t *)0x40039088 // FTM Fault Input Polarity
#define FTM1_SYNCONF            *(volatile uint32_t *)0x4003908C // Synchronization Configuration
#define FTM1_INVCTRL            *(volatile uint32_t *)0x40039090 // FTM Inverting Control
#define FTM1_SWOCTRL            *(volatile uint32_t *)0x40039094 // FTM Software Output Control
#define FTM1_PWMLOAD            *(volatile uint32_t *)0x40039098 // FTM PWM Load

// Chapter 35: Periodic Interrupt Timer (PIT)
#define PIT_MCR                 *(volatile uint32_t *)0x40037000 // PIT Module Control Register
#define PIT_LDVAL0              *(volatile uint32_t *)0x40037100 // Timer Load Value Register
#define PIT_CVAL0               *(volatile uint32_t *)0x40037104 // Current Timer Value Register
#define PIT_TCTRL0              *(volatile uint32_t *)0x40037108 // Timer Control Register
#define PIT_TFLG0               *(volatile uint32_t *)0x4003710C // Timer Flag Register
#define PIT_LDVAL1              *(volatile uint32_t *)0x40037110 // Timer Load Value Register
#define PIT_CVAL1               *(volatile uint32_t *)0x40037114 // Current Timer Value Register
#define PIT_TCTRL1              *(volatile uint32_t *)0x40037118 // Timer Control Register
#define PIT_TFLG1               *(volatile uint32_t *)0x4003711C // Timer Flag Register
#define PIT_LDVAL2              *(volatile uint32_t *)0x40037120 // Timer Load Value Register
#define PIT_CVAL2               *(volatile uint32_t *)0x40037124 // Current Timer Value Register
#define PIT_TCTRL2              *(volatile uint32_t *)0x40037128 // Timer Control Register
#define PIT_TFLG2               *(volatile uint32_t *)0x4003712C // Timer Flag Register
#define PIT_LDVAL3              *(volatile uint32_t *)0x40037130 // Timer Load Value Register
#define PIT_CVAL3               *(volatile uint32_t *)0x40037134 // Current Timer Value Register
#define PIT_TCTRL3              *(volatile uint32_t *)0x40037138 // Timer Control Register
#define PIT_TFLG3               *(volatile uint32_t *)0x4003713C // Timer Flag Register

// Chapter 36: Low-Power Timer (LPTMR)
#define LPTMR0_CSR              *(volatile uint32_t *)0x40040000 // Low Power Timer Control Status Register
#define LPTMR0_PSR              *(volatile uint32_t *)0x40040004 // Low Power Timer Prescale Register
#define LPTMR0_CMR              *(volatile uint32_t *)0x40040008 // Low Power Timer Compare Register
#define LPTMR0_CNR              *(volatile uint32_t *)0x4004000C // Low Power Timer Counter Register

// Chapter 37: Carrier Modulator Transmitter (CMT)
#define CMT_CGH1                *(volatile uint8_t  *)0x40062000 // CMT Carrier Generator High Data Register 1
#define CMT_CGL1                *(volatile uint8_t  *)0x40062001 // CMT Carrier Generator Low Data Register 1
#define CMT_CGH2                *(volatile uint8_t  *)0x40062002 // CMT Carrier Generator High Data Register 2
#define CMT_CGL2                *(volatile uint8_t  *)0x40062003 // CMT Carrier Generator Low Data Register 2
#define CMT_OC                  *(volatile uint8_t  *)0x40062004 // CMT Output Control Register
#define CMT_MSC                 *(volatile uint8_t  *)0x40062005 // CMT Modulator Status and Control Register
#define CMT_CMD1                *(volatile uint8_t  *)0x40062006 // CMT Modulator Data Register Mark High
#define CMT_CMD2                *(volatile uint8_t  *)0x40062007 // CMT Modulator Data Register Mark Low
#define CMT_CMD3                *(volatile uint8_t  *)0x40062008 // CMT Modulator Data Register Space High
#define CMT_CMD4                *(volatile uint8_t  *)0x40062009 // CMT Modulator Data Register Space Low
#define CMT_PPS                 *(volatile uint8_t  *)0x4006200A // CMT Primary Prescaler Register
#define CMT_DMA                 *(volatile uint8_t  *)0x4006200B // CMT Direct Memory Access Register

// Chapter 38: Real Time Clock (RTC)
#define RTC_TSR                 *(volatile uint32_t *)0x4003D000 // RTC Time Seconds Register
#define RTC_TPR                 *(volatile uint32_t *)0x4003D004 // RTC Time Prescaler Register
#define RTC_TAR                 *(volatile uint32_t *)0x4003D008 // RTC Time Alarm Register
#define RTC_TCR                 *(volatile uint32_t *)0x4003D00C // RTC Time Compensation Register
#define RTC_TCR_CIC(n)          (((n) & 255) << 24)     // Compensation Interval Counter
#define RTC_TCR_TCV(n)          (((n) & 255) << 16)     // Time Compensation Value
#define RTC_TCR_CIR(n)          (((n) & 255) << 8)      // Compensation Interval Register
#define RTC_TCR_TCR(n)          (((n) & 255) << 0)      // Time Compensation Register
#define RTC_CR                  *(volatile uint32_t *)0x4003D010 // RTC Control Register
#define RTC_CR_SC2P         (uint32_t)0x00002000        // 
#define RTC_CR_SC4P         (uint32_t)0x00001000        // 
#define RTC_CR_SC8P         (uint32_t)0x00000800        // 
#define RTC_CR_SC16P            (uint32_t)0x00000400        // 
#define RTC_CR_CLKO         (uint32_t)0x00000200        // 
#define RTC_CR_OSCE         (uint32_t)0x00000100        // 
#define RTC_CR_UM           (uint32_t)0x00000008        // 
#define RTC_CR_SUP          (uint32_t)0x00000004        // 
#define RTC_CR_WPE          (uint32_t)0x00000002        // 
#define RTC_CR_SWR          (uint32_t)0x00000001        // 
#define RTC_SR                  *(volatile uint32_t *)0x4003D014 // RTC Status Register
#define RTC_SR_TCE          (uint32_t)0x00000010        // 
#define RTC_SR_TAF          (uint32_t)0x00000004        // 
#define RTC_SR_TOF          (uint32_t)0x00000002        // 
#define RTC_SR_TIF          (uint32_t)0x00000001        // 
#define RTC_LR                  *(volatile uint32_t *)0x4003D018 // RTC Lock Register
#define RTC_IER                 *(volatile uint32_t *)0x4003D01C // RTC Interrupt Enable Register
#define RTC_WAR                 *(volatile uint32_t *)0x4003D800 // RTC Write Access Register
#define RTC_RAR                 *(volatile uint32_t *)0x4003D804 // RTC Read Access Register

