Blinkinlabs/EightByEight/bootloader/mk20dn64.h
// Chapter 39: Universal Serial Bus OTG Controller (USBOTG)
#define USB0_PERID              *(const    uint8_t  *)0x40072000 // Peripheral ID register
#define USB0_IDCOMP             *(const    uint8_t  *)0x40072004 // Peripheral ID Complement register
#define USB0_REV                *(const    uint8_t  *)0x40072008 // Peripheral Revision register
#define USB0_ADDINFO            *(volatile uint8_t  *)0x4007200C // Peripheral Additional Info register
#define USB0_OTGISTAT           *(volatile uint8_t  *)0x40072010 // OTG Interrupt Status register
#define USB_OTGISTAT_IDCHG      (uint8_t)0x80           //
#define USB_OTGISTAT_ONEMSEC        (uint8_t)0x40           //
#define USB_OTGISTAT_LINE_STATE_CHG (uint8_t)0x20           //
#define USB_OTGISTAT_SESSVLDCHG     (uint8_t)0x08           //
#define USB_OTGISTAT_B_SESS_CHG     (uint8_t)0x04           //
#define USB_OTGISTAT_AVBUSCHG       (uint8_t)0x01           //
#define USB0_OTGICR             *(volatile uint8_t  *)0x40072014 // OTG Interrupt Control Register
#define USB_OTGICR_IDEN         (uint8_t)0x80           // 
#define USB_OTGICR_ONEMSECEN        (uint8_t)0x40           // 
#define USB_OTGICR_LINESTATEEN      (uint8_t)0x20           // 
#define USB_OTGICR_SESSVLDEN        (uint8_t)0x08           // 
#define USB_OTGICR_BSESSEN      (uint8_t)0x04           // 
#define USB_OTGICR_AVBUSEN      (uint8_t)0x01           // 
#define USB0_OTGSTAT            *(volatile uint8_t  *)0x40072018 // OTG Status register
#define USB_OTGSTAT_ID          (uint8_t)0x80           // 
#define USB_OTGSTAT_ONEMSECEN       (uint8_t)0x40           // 
#define USB_OTGSTAT_LINESTATESTABLE (uint8_t)0x20           // 
#define USB_OTGSTAT_SESS_VLD        (uint8_t)0x08           // 
#define USB_OTGSTAT_BSESSEND        (uint8_t)0x04           // 
#define USB_OTGSTAT_AVBUSVLD        (uint8_t)0x01           // 
#define USB0_OTGCTL             *(volatile uint8_t  *)0x4007201C // OTG Control Register
#define USB_OTGCTL_DPHIGH       (uint8_t)0x80           // 
#define USB_OTGCTL_DPLOW        (uint8_t)0x20           // 
#define USB_OTGCTL_DMLOW        (uint8_t)0x10           // 
#define USB_OTGCTL_OTGEN        (uint8_t)0x04           // 
#define USB0_ISTAT              *(volatile uint8_t  *)0x40072080 // Interrupt Status Register
#define USB_ISTAT_STALL         (uint8_t)0x80           // 
#define USB_ISTAT_ATTACH        (uint8_t)0x40           // 
#define USB_ISTAT_RESUME        (uint8_t)0x20           // 
#define USB_ISTAT_SLEEP         (uint8_t)0x10           // 
#define USB_ISTAT_TOKDNE        (uint8_t)0x08           // 
#define USB_ISTAT_SOFTOK        (uint8_t)0x04           // 
#define USB_ISTAT_ERROR         (uint8_t)0x02           // 
#define USB_ISTAT_USBRST        (uint8_t)0x01           // 
#define USB0_INTEN              *(volatile uint8_t  *)0x40072084 // Interrupt Enable Register
#define USB_INTEN_STALLEN       (uint8_t)0x80           // 
#define USB_INTEN_ATTACHEN      (uint8_t)0x40           // 
#define USB_INTEN_RESUMEEN      (uint8_t)0x20           // 
#define USB_INTEN_SLEEPEN       (uint8_t)0x10           // 
#define USB_INTEN_TOKDNEEN      (uint8_t)0x08           // 
#define USB_INTEN_SOFTOKEN      (uint8_t)0x04           // 
#define USB_INTEN_ERROREN       (uint8_t)0x02           // 
#define USB_INTEN_USBRSTEN      (uint8_t)0x01           // 
#define USB0_ERRSTAT            *(volatile uint8_t  *)0x40072088 // Error Interrupt Status Register
#define USB_ERRSTAT_BTSERR      (uint8_t)0x80           // 
#define USB_ERRSTAT_DMAERR      (uint8_t)0x20           // 
#define USB_ERRSTAT_BTOERR      (uint8_t)0x10           // 
#define USB_ERRSTAT_DFN8        (uint8_t)0x08           // 
#define USB_ERRSTAT_CRC16       (uint8_t)0x04           // 
#define USB_ERRSTAT_CRC5EOF     (uint8_t)0x02           // 
#define USB_ERRSTAT_PIDERR      (uint8_t)0x01           // 
#define USB0_ERREN              *(volatile uint8_t  *)0x4007208C // Error Interrupt Enable Register
#define USB_ERREN_BTSERREN      (uint8_t)0x80           // 
#define USB_ERREN_DMAERREN      (uint8_t)0x20           // 
#define USB_ERREN_BTOERREN      (uint8_t)0x10           // 
#define USB_ERREN_DFN8EN        (uint8_t)0x08           // 
#define USB_ERREN_CRC16EN       (uint8_t)0x04           // 
#define USB_ERREN_CRC5EOFEN     (uint8_t)0x02           // 
#define USB_ERREN_PIDERREN      (uint8_t)0x01           // 
#define USB0_STAT               *(volatile uint8_t  *)0x40072090 // Status Register
#define USB_STAT_TX         (uint8_t)0x08           // 
#define USB_STAT_ODD            (uint8_t)0x04           // 
#define USB_STAT_ENDP(n)        (uint8_t)((n) >> 4)     // 
#define USB0_CTL                *(volatile uint8_t  *)0x40072094 // Control Register
#define USB_CTL_JSTATE          (uint8_t)0x80           // 
#define USB_CTL_SE0         (uint8_t)0x40           // 
#define USB_CTL_TXSUSPENDTOKENBUSY  (uint8_t)0x20           // 
#define USB_CTL_RESET           (uint8_t)0x10           // 
#define USB_CTL_HOSTMODEEN      (uint8_t)0x08           // 
#define USB_CTL_RESUME          (uint8_t)0x04           // 
#define USB_CTL_ODDRST          (uint8_t)0x02           // 
#define USB_CTL_USBENSOFEN      (uint8_t)0x01           // 
#define USB0_ADDR               *(volatile uint8_t  *)0x40072098 // Address Register
#define USB0_BDTPAGE1           *(volatile uint8_t  *)0x4007209C // BDT Page Register 1
#define USB0_FRMNUML            *(volatile uint8_t  *)0x400720A0 // Frame Number Register Low
#define USB0_FRMNUMH            *(volatile uint8_t  *)0x400720A4 // Frame Number Register High
#define USB0_TOKEN              *(volatile uint8_t  *)0x400720A8 // Token Register
#define USB0_SOFTHLD            *(volatile uint8_t  *)0x400720AC // SOF Threshold Register
#define USB0_BDTPAGE2           *(volatile uint8_t  *)0x400720B0 // BDT Page Register 2
#define USB0_BDTPAGE3           *(volatile uint8_t  *)0x400720B4 // BDT Page Register 3
#define USB0_ENDPT0             *(volatile uint8_t  *)0x400720C0 // Endpoint Control Register
#define USB_ENDPT_HOSTWOHUB     (uint8_t)0x80           // host only, enable low speed
#define USB_ENDPT_RETRYDIS      (uint8_t)0x40           // host only, set to disable NAK retry
#define USB_ENDPT_EPCTLDIS      (uint8_t)0x10           // 0=control, 1=bulk, interrupt, isync
#define USB_ENDPT_EPRXEN        (uint8_t)0x08           // enables the endpoint for RX transfers.
#define USB_ENDPT_EPTXEN        (uint8_t)0x04           // enables the endpoint for TX transfers.
#define USB_ENDPT_EPSTALL       (uint8_t)0x02           // set to stall endpoint
#define USB_ENDPT_EPHSHK        (uint8_t)0x01           // enable handshaking during a transaction, generally set unless Isochronous
#define USB0_ENDPT1             *(volatile uint8_t  *)0x400720C4 // Endpoint Control Register
#define USB0_ENDPT2             *(volatile uint8_t  *)0x400720C8 // Endpoint Control Register
#define USB0_ENDPT3             *(volatile uint8_t  *)0x400720CC // Endpoint Control Register
#define USB0_ENDPT4             *(volatile uint8_t  *)0x400720D0 // Endpoint Control Register
#define USB0_ENDPT5             *(volatile uint8_t  *)0x400720D4 // Endpoint Control Register
#define USB0_ENDPT6             *(volatile uint8_t  *)0x400720D8 // Endpoint Control Register
#define USB0_ENDPT7             *(volatile uint8_t  *)0x400720DC // Endpoint Control Register
#define USB0_ENDPT8             *(volatile uint8_t  *)0x400720E0 // Endpoint Control Register
#define USB0_ENDPT9             *(volatile uint8_t  *)0x400720E4 // Endpoint Control Register
#define USB0_ENDPT10            *(volatile uint8_t  *)0x400720E8 // Endpoint Control Register
#define USB0_ENDPT11            *(volatile uint8_t  *)0x400720EC // Endpoint Control Register
#define USB0_ENDPT12            *(volatile uint8_t  *)0x400720F0 // Endpoint Control Register
#define USB0_ENDPT13            *(volatile uint8_t  *)0x400720F4 // Endpoint Control Register
#define USB0_ENDPT14            *(volatile uint8_t  *)0x400720F8 // Endpoint Control Register
#define USB0_ENDPT15            *(volatile uint8_t  *)0x400720FC // Endpoint Control Register
#define USB0_USBCTRL            *(volatile uint8_t  *)0x40072100 // USB Control Register
#define USB_USBCTRL_SUSP        (uint8_t)0x80           // Places the USB transceiver into the suspend state.
#define USB_USBCTRL_PDE         (uint8_t)0x40           // Enables the weak pulldowns on the USB transceiver.
#define USB0_OBSERVE            *(volatile uint8_t  *)0x40072104 // USB OTG Observe Register
#define USB_OBSERVE_DPPU        (uint8_t)0x80           // 
#define USB_OBSERVE_DPPD        (uint8_t)0x40           // 
#define USB_OBSERVE_DMPD        (uint8_t)0x10           // 
#define USB0_CONTROL            *(volatile uint8_t  *)0x40072108 // USB OTG Control Register
#define USB_CONTROL_DPPULLUPNONOTG  (uint8_t)0x10           //  Provides control of the DP PULLUP in the USB OTG module, if USB is configured in non-OTG device mode.
#define USB0_USBTRC0            *(volatile uint8_t  *)0x4007210C // USB Transceiver Control Register 0
#define USB_USBTRC_USBRESET     (uint8_t)0x80           //
#define USB_USBTRC_USBRESMEN        (uint8_t)0x20           //
#define USB_USBTRC_SYNC_DET     (uint8_t)0x02           //
#define USB_USBTRC_USB_RESUME_INT   (uint8_t)0x01           //
#define USB0_USBFRMADJUST       *(volatile uint8_t  *)0x40072114 // Frame Adjust Register

// Chapter 40: USB Device Charger Detection Module (USBDCD)
#define USBDCD_CONTROL          *(volatile uint32_t *)0x40035000 // Control register
#define USBDCD_CLOCK            *(volatile uint32_t *)0x40035004 // Clock register
#define USBDCD_STATUS           *(volatile uint32_t *)0x40035008 // Status register
#define USBDCD_TIMER0           *(volatile uint32_t *)0x40035010 // TIMER0 register
#define USBDCD_TIMER1           *(volatile uint32_t *)0x40035014 // TIMER1 register
#define USBDCD_TIMER2           *(volatile uint32_t *)0x40035018 // TIMER2 register

// Chapter 42: SPI (DSPI)
#define SPI0_MCR                *(volatile uint32_t *)0x4002C000 // DSPI Module Configuration Register
#define SPI_MCR_MSTR            (uint32_t)0x80000000        // Master/Slave Mode Select
#define SPI_MCR_CONT_SCKE       (uint32_t)0x40000000        // 
#define SPI_MCR_DCONF(n)        (((n) & 3) << 28)       // 
#define SPI_MCR_FRZ         (uint32_t)0x08000000        // 
#define SPI_MCR_MTFE            (uint32_t)0x04000000        // 
#define SPI_MCR_ROOE            (uint32_t)0x01000000        // 
#define SPI_MCR_PCSIS(n)        (((n) & 0x1F) << 16)        //
#define SPI_MCR_DOZE            (uint32_t)0x00008000        // 
#define SPI_MCR_MDIS            (uint32_t)0x00004000        // 
#define SPI_MCR_DIS_TXF         (uint32_t)0x00002000        // 
#define SPI_MCR_DIS_RXF         (uint32_t)0x00001000        // 
#define SPI_MCR_CLR_TXF         (uint32_t)0x00000800        // 
#define SPI_MCR_CLR_RXF         (uint32_t)0x00000400        // 
#define SPI_MCR_SMPL_PT(n)      (((n) & 3) << 8)        //
#define SPI_MCR_HALT            (uint32_t)0x00000001        // 
#define SPI0_TCR                *(volatile uint32_t *)0x4002C008 // DSPI Transfer Count Register
#define SPI0_CTAR0              *(volatile uint32_t *)0x4002C00C // DSPI Clock and Transfer Attributes Register, In Master Mode
#define SPI_CTAR_DBR            (uint32_t)0x80000000        // Double Baud Rate
#define SPI_CTAR_FMSZ(n)        (((n) & 15) << 27)      // Frame Size (+1)
#define SPI_CTAR_CPOL           (uint32_t)0x04000000        // Clock Polarity
#define SPI_CTAR_CPHA           (uint32_t)0x02000000        // Clock Phase
#define SPI_CTAR_LSBFE          (uint32_t)0x01000000        // LSB First
#define SPI_CTAR_PCSSCK(n)      (((n) & 3) << 22)       // PCS to SCK Delay Prescaler
#define SPI_CTAR_PASC(n)        (((n) & 3) << 20)       // After SCK Delay Prescaler
#define SPI_CTAR_PDT(n)         (((n) & 3) << 18)       // Delay after Transfer Prescaler
#define SPI_CTAR_PBR(n)         (((n) & 3) << 16)       // Baud Rate Prescaler
#define SPI_CTAR_CSSCK(n)       (((n) & 15) << 12)      // PCS to SCK Delay Scaler
#define SPI_CTAR_ASC(n)         (((n) & 15) << 8)       // After SCK Delay Scaler
#define SPI_CTAR_DT(n)          (((n) & 15) << 4)       // Delay After Transfer Scaler
#define SPI_CTAR_BR(n)          (((n) & 15) << 0)       // Baud Rate Scaler
#define SPI0_CTAR0_SLAVE        *(volatile uint32_t *)0x4002C00C // DSPI Clock and Transfer Attributes Register, In Slave Mode
#define SPI0_CTAR1              *(volatile uint32_t *)0x4002C010 // DSPI Clock and Transfer Attributes Register, In Master Mode
#define SPI0_SR                 *(volatile uint32_t *)0x4002C02C // DSPI Status Register
#define SPI_SR_TCF          (uint32_t)0x80000000        // Transfer Complete Flag
#define SPI_SR_TXRXS            (uint32_t)0x40000000        // TX and RX Status
#define SPI_SR_EOQF         (uint32_t)0x10000000        // End of Queue Flag
#define SPI_SR_TFUF         (uint32_t)0x08000000        // Transmit FIFO Underflow Flag
#define SPI_SR_TFFF         (uint32_t)0x02000000        // Transmit FIFO Fill Flag
#define SPI_SR_RFOF         (uint32_t)0x00080000        // Receive FIFO Overflow Flag
#define SPI_SR_RFDF         (uint32_t)0x00020000        // Receive FIFO Drain Flag
#define SPI0_RSER               *(volatile uint32_t *)0x4002C030 // DSPI DMA/Interrupt Request Select and Enable Register
#define SPI0_PUSHR              *(volatile uint32_t *)0x4002C034 // DSPI PUSH TX FIFO Register In Master Mode
#define SPI_PUSHR_CONT          (uint32_t)0x80000000        // 
#define SPI_PUSHR_CTAS(n)       (((n) & 7) << 28)       // 
#define SPI_PUSHR_EOQ           (uint32_t)0x08000000        // 
#define SPI_PUSHR_CTCNT         (uint32_t)0x04000000        // 
#define SPI_PUSHR_PCS(n)        (((n) & 31) << 16)      //
#define SPI0_PUSHR_SLAVE        *(volatile uint32_t *)0x4002C034 // DSPI PUSH TX FIFO Register In Slave Mode
#define SPI0_POPR               *(volatile uint32_t *)0x4002C038 // DSPI POP RX FIFO Register
#define SPI0_TXFR0              *(volatile uint32_t *)0x4002C03C // DSPI Transmit FIFO Registers
#define SPI0_TXFR1              *(volatile uint32_t *)0x4002C040 // DSPI Transmit FIFO Registers
#define SPI0_TXFR2              *(volatile uint32_t *)0x4002C044 // DSPI Transmit FIFO Registers
#define SPI0_TXFR3              *(volatile uint32_t *)0x4002C048 // DSPI Transmit FIFO Registers
#define SPI0_RXFR0              *(volatile uint32_t *)0x4002C07C // DSPI Receive FIFO Registers
#define SPI0_RXFR1              *(volatile uint32_t *)0x4002C080 // DSPI Receive FIFO Registers
#define SPI0_RXFR2              *(volatile uint32_t *)0x4002C084 // DSPI Receive FIFO Registers
#define SPI0_RXFR3              *(volatile uint32_t *)0x4002C088 // DSPI Receive FIFO Registers

// Chapter 43: Inter-Integrated Circuit (I2C)
#define I2C0_A1                 *(volatile uint8_t  *)0x40066000 // I2C Address Register 1
#define I2C0_F                  *(volatile uint8_t  *)0x40066001 // I2C Frequency Divider register
#define I2C0_C1                 *(volatile uint8_t  *)0x40066002 // I2C Control Register 1
#define I2C_C1_IICEN            (uint8_t)0x80           // I2C Enable
#define I2C_C1_IICIE            (uint8_t)0x40           // I2C Interrupt Enable
#define I2C_C1_MST          (uint8_t)0x20           // Master Mode Select
#define I2C_C1_TX           (uint8_t)0x10           // Transmit Mode Select
#define I2C_C1_TXAK         (uint8_t)0x08           // Transmit Acknowledge Enable
#define I2C_C1_RSTA         (uint8_t)0x04           // Repeat START
#define I2C_C1_WUEN         (uint8_t)0x02           // Wakeup Enable
#define I2C_C1_DMAEN            (uint8_t)0x01           // DMA Enable
#define I2C0_S                  *(volatile uint8_t  *)0x40066003 // I2C Status register
#define I2C_S_TCF           (uint8_t)0x80           // Transfer Complete Flag
#define I2C_S_IAAS          (uint8_t)0x40           // Addressed As A Slave
#define I2C_S_BUSY          (uint8_t)0x20           // Bus Busy
#define I2C_S_ARBL          (uint8_t)0x10           // Arbitration Lost
#define I2C_S_RAM           (uint8_t)0x08           // Range Address Match
#define I2C_S_SRW           (uint8_t)0x04           // Slave Read/Write
#define I2C_S_IICIF         (uint8_t)0x02           // Interrupt Flag
#define I2C_S_RXAK          (uint8_t)0x01           // Receive Acknowledge
#define I2C0_D                  *(volatile uint8_t  *)0x40066004 // I2C Data I/O register
#define I2C0_C2                 *(volatile uint8_t  *)0x40066005 // I2C Control Register 2
#define I2C_C2_GCAEN            (uint8_t)0x80           // General Call Address Enable
#define I2C_C2_ADEXT            (uint8_t)0x40           // Address Extension
#define I2C_C2_HDRS         (uint8_t)0x20           // High Drive Select
#define I2C_C2_SBRC         (uint8_t)0x10           // Slave Baud Rate Control
#define I2C_C2_RMEN         (uint8_t)0x08           // Range Address Matching Enable
#define I2C_C2_AD(n)            ((n) & 7)           // Slave Address, upper 3 bits
#define I2C0_FLT                *(volatile uint8_t  *)0x40066006 // I2C Programmable Input Glitch Filter register
#define I2C0_RA                 *(volatile uint8_t  *)0x40066007 // I2C Range Address register
#define I2C0_SMB                *(volatile uint8_t  *)0x40066008 // I2C SMBus Control and Status register
#define I2C0_A2                 *(volatile uint8_t  *)0x40066009 // I2C Address Register 2
#define I2C0_SLTH               *(volatile uint8_t  *)0x4006600A // I2C SCL Low Timeout Register High
#define I2C0_SLTL               *(volatile uint8_t  *)0x4006600B // I2C SCL Low Timeout Register Low

