Blinkinlabs/EightByEight/bootloader/mk20dn64.h
// Chapter 44: Universal Asynchronous Receiver/Transmitter (UART)
#define UART0_BDH               *(volatile uint8_t  *)0x4006A000 // UART Baud Rate Registers: High
#define UART0_BDL               *(volatile uint8_t  *)0x4006A001 // UART Baud Rate Registers: Low
#define UART0_C1                *(volatile uint8_t  *)0x4006A002 // UART Control Register 1
#define UART_C1_LOOPS           (uint8_t)0x80           // When LOOPS is set, the RxD pin is disconnected from the UART and the transmitter output is internally connected to the receiver input
#define UART_C1_UARTSWAI        (uint8_t)0x40           // UART Stops in Wait Mode
#define UART_C1_RSRC            (uint8_t)0x20           // When LOOPS is set, the RSRC field determines the source for the receiver shift register input
#define UART_C1_M           (uint8_t)0x10           // 9-bit or 8-bit Mode Select
#define UART_C1_WAKE            (uint8_t)0x08           // Determines which condition wakes the UART
#define UART_C1_ILT         (uint8_t)0x04           // Idle Line Type Select
#define UART_C1_PE          (uint8_t)0x02           // Parity Enable
#define UART_C1_PT          (uint8_t)0x01           // Parity Type, 0=even, 1=odd
#define UART0_C2                *(volatile uint8_t  *)0x4006A003 // UART Control Register 2
#define UART_C2_TIE         (uint8_t)0x80           // Transmitter Interrupt or DMA Transfer Enable.
#define UART_C2_TCIE            (uint8_t)0x40           // Transmission Complete Interrupt Enable
#define UART_C2_RIE         (uint8_t)0x20           // Receiver Full Interrupt or DMA Transfer Enable
#define UART_C2_ILIE            (uint8_t)0x10           // Idle Line Interrupt Enable
#define UART_C2_TE          (uint8_t)0x08           // Transmitter Enable
#define UART_C2_RE          (uint8_t)0x04           // Receiver Enable
#define UART_C2_RWU         (uint8_t)0x02           // Receiver Wakeup Control
#define UART_C2_SBK         (uint8_t)0x01           // Send Break
#define UART0_S1                *(volatile uint8_t  *)0x4006A004 // UART Status Register 1
#define UART_S1_TDRE            (uint8_t)0x80           // Transmit Data Register Empty Flag
#define UART_S1_TC          (uint8_t)0x40           // Transmit Complete Flag
#define UART_S1_RDRF            (uint8_t)0x20           // Receive Data Register Full Flag
#define UART_S1_IDLE            (uint8_t)0x10           // Idle Line Flag
#define UART_S1_OR          (uint8_t)0x08           // Receiver Overrun Flag
#define UART_S1_NF          (uint8_t)0x04           // Noise Flag
#define UART_S1_FE          (uint8_t)0x02           // Framing Error Flag
#define UART_S1_PF          (uint8_t)0x01           // Parity Error Flag
#define UART0_S2                *(volatile uint8_t  *)0x4006A005 // UART Status Register 2
#define UART0_C3                *(volatile uint8_t  *)0x4006A006 // UART Control Register 3
#define UART0_D                 *(volatile uint8_t  *)0x4006A007 // UART Data Register
#define UART0_MA1               *(volatile uint8_t  *)0x4006A008 // UART Match Address Registers 1
#define UART0_MA2               *(volatile uint8_t  *)0x4006A009 // UART Match Address Registers 2
#define UART0_C4                *(volatile uint8_t  *)0x4006A00A // UART Control Register 4
#define UART0_C5                *(volatile uint8_t  *)0x4006A00B // UART Control Register 5
#define UART0_ED                *(volatile uint8_t  *)0x4006A00C // UART Extended Data Register
#define UART0_MODEM             *(volatile uint8_t  *)0x4006A00D // UART Modem Register
#define UART0_IR                *(volatile uint8_t  *)0x4006A00E // UART Infrared Register
#define UART0_PFIFO             *(volatile uint8_t  *)0x4006A010 // UART FIFO Parameters
#define UART_PFIFO_TXFE         (uint8_t)0x80
#define UART_PFIFO_RXFE         (uint8_t)0x08
#define UART0_CFIFO             *(volatile uint8_t  *)0x4006A011 // UART FIFO Control Register
#define UART_CFIFO_TXFLUSH      (uint8_t)0x80           // 
#define UART_CFIFO_RXFLUSH      (uint8_t)0x40           // 
#define UART_CFIFO_RXOFE        (uint8_t)0x04           // 
#define UART_CFIFO_TXOFE        (uint8_t)0x02           // 
#define UART_CFIFO_RXUFE        (uint8_t)0x01           // 
#define UART0_SFIFO             *(volatile uint8_t  *)0x4006A012 // UART FIFO Status Register
#define UART_SFIFO_TXEMPT       (uint8_t)0x80
#define UART_SFIFO_RXEMPT       (uint8_t)0x40
#define UART_SFIFO_RXOF         (uint8_t)0x04
#define UART_SFIFO_TXOF         (uint8_t)0x02
#define UART_SFIFO_RXUF         (uint8_t)0x01
#define UART0_TWFIFO            *(volatile uint8_t  *)0x4006A013 // UART FIFO Transmit Watermark
#define UART0_TCFIFO            *(volatile uint8_t  *)0x4006A014 // UART FIFO Transmit Count
#define UART0_RWFIFO            *(volatile uint8_t  *)0x4006A015 // UART FIFO Receive Watermark
#define UART0_RCFIFO            *(volatile uint8_t  *)0x4006A016 // UART FIFO Receive Count
#define UART0_C7816             *(volatile uint8_t  *)0x4006A018 // UART 7816 Control Register
#define UART0_IE7816            *(volatile uint8_t  *)0x4006A019 // UART 7816 Interrupt Enable Register
#define UART0_IS7816            *(volatile uint8_t  *)0x4006A01A // UART 7816 Interrupt Status Register
#define UART0_WP7816T0          *(volatile uint8_t  *)0x4006A01B // UART 7816 Wait Parameter Register
#define UART0_WP7816T1          *(volatile uint8_t  *)0x4006A01B // UART 7816 Wait Parameter Register
#define UART0_WN7816            *(volatile uint8_t  *)0x4006A01C // UART 7816 Wait N Register
#define UART0_WF7816            *(volatile uint8_t  *)0x4006A01D // UART 7816 Wait FD Register
#define UART0_ET7816            *(volatile uint8_t  *)0x4006A01E // UART 7816 Error Threshold Register
#define UART0_TL7816            *(volatile uint8_t  *)0x4006A01F // UART 7816 Transmit Length Register
#define UART0_C6                *(volatile uint8_t  *)0x4006A021 // UART CEA709.1-B Control Register 6
#define UART0_PCTH              *(volatile uint8_t  *)0x4006A022 // UART CEA709.1-B Packet Cycle Time Counter High
#define UART0_PCTL              *(volatile uint8_t  *)0x4006A023 // UART CEA709.1-B Packet Cycle Time Counter Low
#define UART0_B1T               *(volatile uint8_t  *)0x4006A024 // UART CEA709.1-B Beta1 Timer
#define UART0_SDTH              *(volatile uint8_t  *)0x4006A025 // UART CEA709.1-B Secondary Delay Timer High
#define UART0_SDTL              *(volatile uint8_t  *)0x4006A026 // UART CEA709.1-B Secondary Delay Timer Low
#define UART0_PRE               *(volatile uint8_t  *)0x4006A027 // UART CEA709.1-B Preamble
#define UART0_TPL               *(volatile uint8_t  *)0x4006A028 // UART CEA709.1-B Transmit Packet Length
#define UART0_IE                *(volatile uint8_t  *)0x4006A029 // UART CEA709.1-B Interrupt Enable Register
#define UART0_WB                *(volatile uint8_t  *)0x4006A02A // UART CEA709.1-B WBASE
#define UART0_S3                *(volatile uint8_t  *)0x4006A02B // UART CEA709.1-B Status Register
#define UART0_S4                *(volatile uint8_t  *)0x4006A02C // UART CEA709.1-B Status Register
#define UART0_RPL               *(volatile uint8_t  *)0x4006A02D // UART CEA709.1-B Received Packet Length
#define UART0_RPREL             *(volatile uint8_t  *)0x4006A02E // UART CEA709.1-B Received Preamble Length
#define UART0_CPW               *(volatile uint8_t  *)0x4006A02F // UART CEA709.1-B Collision Pulse Width
#define UART0_RIDT              *(volatile uint8_t  *)0x4006A030 // UART CEA709.1-B Receive Indeterminate Time
#define UART0_TIDT              *(volatile uint8_t  *)0x4006A031 // UART CEA709.1-B Transmit Indeterminate Time
#define UART1_BDH               *(volatile uint8_t  *)0x4006B000 // UART Baud Rate Registers: High
#define UART1_BDL               *(volatile uint8_t  *)0x4006B001 // UART Baud Rate Registers: Low
#define UART1_C1                *(volatile uint8_t  *)0x4006B002 // UART Control Register 1
#define UART1_C2                *(volatile uint8_t  *)0x4006B003 // UART Control Register 2
#define UART1_S1                *(volatile uint8_t  *)0x4006B004 // UART Status Register 1
#define UART1_S2                *(volatile uint8_t  *)0x4006B005 // UART Status Register 2
#define UART1_C3                *(volatile uint8_t  *)0x4006B006 // UART Control Register 3
#define UART1_D                 *(volatile uint8_t  *)0x4006B007 // UART Data Register
#define UART1_MA1               *(volatile uint8_t  *)0x4006B008 // UART Match Address Registers 1
#define UART1_MA2               *(volatile uint8_t  *)0x4006B009 // UART Match Address Registers 2
#define UART1_C4                *(volatile uint8_t  *)0x4006B00A // UART Control Register 4
#define UART1_C5                *(volatile uint8_t  *)0x4006B00B // UART Control Register 5
#define UART1_ED                *(volatile uint8_t  *)0x4006B00C // UART Extended Data Register
#define UART1_MODEM             *(volatile uint8_t  *)0x4006B00D // UART Modem Register
#define UART1_IR                *(volatile uint8_t  *)0x4006B00E // UART Infrared Register
#define UART1_PFIFO             *(volatile uint8_t  *)0x4006B010 // UART FIFO Parameters
#define UART1_CFIFO             *(volatile uint8_t  *)0x4006B011 // UART FIFO Control Register
#define UART1_SFIFO             *(volatile uint8_t  *)0x4006B012 // UART FIFO Status Register
#define UART1_TWFIFO            *(volatile uint8_t  *)0x4006B013 // UART FIFO Transmit Watermark
#define UART1_TCFIFO            *(volatile uint8_t  *)0x4006B014 // UART FIFO Transmit Count
#define UART1_RWFIFO            *(volatile uint8_t  *)0x4006B015 // UART FIFO Receive Watermark
#define UART1_RCFIFO            *(volatile uint8_t  *)0x4006B016 // UART FIFO Receive Count
#define UART1_C7816             *(volatile uint8_t  *)0x4006B018 // UART 7816 Control Register
#define UART1_IE7816            *(volatile uint8_t  *)0x4006B019 // UART 7816 Interrupt Enable Register
#define UART1_IS7816            *(volatile uint8_t  *)0x4006B01A // UART 7816 Interrupt Status Register
#define UART1_WP7816T0          *(volatile uint8_t  *)0x4006B01B // UART 7816 Wait Parameter Register
#define UART1_WP7816T1          *(volatile uint8_t  *)0x4006B01B // UART 7816 Wait Parameter Register
#define UART1_WN7816            *(volatile uint8_t  *)0x4006B01C // UART 7816 Wait N Register
#define UART1_WF7816            *(volatile uint8_t  *)0x4006B01D // UART 7816 Wait FD Register
#define UART1_ET7816            *(volatile uint8_t  *)0x4006B01E // UART 7816 Error Threshold Register
#define UART1_TL7816            *(volatile uint8_t  *)0x4006B01F // UART 7816 Transmit Length Register
#define UART1_C6                *(volatile uint8_t  *)0x4006B021 // UART CEA709.1-B Control Register 6
#define UART1_PCTH              *(volatile uint8_t  *)0x4006B022 // UART CEA709.1-B Packet Cycle Time Counter High
#define UART1_PCTL              *(volatile uint8_t  *)0x4006B023 // UART CEA709.1-B Packet Cycle Time Counter Low
#define UART1_B1T               *(volatile uint8_t  *)0x4006B024 // UART CEA709.1-B Beta1 Timer
#define UART1_SDTH              *(volatile uint8_t  *)0x4006B025 // UART CEA709.1-B Secondary Delay Timer High
#define UART1_SDTL              *(volatile uint8_t  *)0x4006B026 // UART CEA709.1-B Secondary Delay Timer Low
#define UART1_PRE               *(volatile uint8_t  *)0x4006B027 // UART CEA709.1-B Preamble
#define UART1_TPL               *(volatile uint8_t  *)0x4006B028 // UART CEA709.1-B Transmit Packet Length
#define UART1_IE                *(volatile uint8_t  *)0x4006B029 // UART CEA709.1-B Interrupt Enable Register
#define UART1_WB                *(volatile uint8_t  *)0x4006B02A // UART CEA709.1-B WBASE
#define UART1_S3                *(volatile uint8_t  *)0x4006B02B // UART CEA709.1-B Status Register
#define UART1_S4                *(volatile uint8_t  *)0x4006B02C // UART CEA709.1-B Status Register
#define UART1_RPL               *(volatile uint8_t  *)0x4006B02D // UART CEA709.1-B Received Packet Length
#define UART1_RPREL             *(volatile uint8_t  *)0x4006B02E // UART CEA709.1-B Received Preamble Length
#define UART1_CPW               *(volatile uint8_t  *)0x4006B02F // UART CEA709.1-B Collision Pulse Width
#define UART1_RIDT              *(volatile uint8_t  *)0x4006B030 // UART CEA709.1-B Receive Indeterminate Time
#define UART1_TIDT              *(volatile uint8_t  *)0x4006B031 // UART CEA709.1-B Transmit Indeterminate Time
#define UART2_BDH               *(volatile uint8_t  *)0x4006C000 // UART Baud Rate Registers: High
#define UART2_BDL               *(volatile uint8_t  *)0x4006C001 // UART Baud Rate Registers: Low
#define UART2_C1                *(volatile uint8_t  *)0x4006C002 // UART Control Register 1
#define UART2_C2                *(volatile uint8_t  *)0x4006C003 // UART Control Register 2
#define UART2_S1                *(volatile uint8_t  *)0x4006C004 // UART Status Register 1
#define UART2_S2                *(volatile uint8_t  *)0x4006C005 // UART Status Register 2
#define UART2_C3                *(volatile uint8_t  *)0x4006C006 // UART Control Register 3
#define UART2_D                 *(volatile uint8_t  *)0x4006C007 // UART Data Register
#define UART2_MA1               *(volatile uint8_t  *)0x4006C008 // UART Match Address Registers 1
#define UART2_MA2               *(volatile uint8_t  *)0x4006C009 // UART Match Address Registers 2
#define UART2_C4                *(volatile uint8_t  *)0x4006C00A // UART Control Register 4
#define UART2_C5                *(volatile uint8_t  *)0x4006C00B // UART Control Register 5
#define UART2_ED                *(volatile uint8_t  *)0x4006C00C // UART Extended Data Register
#define UART2_MODEM             *(volatile uint8_t  *)0x4006C00D // UART Modem Register
#define UART2_IR                *(volatile uint8_t  *)0x4006C00E // UART Infrared Register
#define UART2_PFIFO             *(volatile uint8_t  *)0x4006C010 // UART FIFO Parameters
#define UART2_CFIFO             *(volatile uint8_t  *)0x4006C011 // UART FIFO Control Register
#define UART2_SFIFO             *(volatile uint8_t  *)0x4006C012 // UART FIFO Status Register
#define UART2_TWFIFO            *(volatile uint8_t  *)0x4006C013 // UART FIFO Transmit Watermark
#define UART2_TCFIFO            *(volatile uint8_t  *)0x4006C014 // UART FIFO Transmit Count
#define UART2_RWFIFO            *(volatile uint8_t  *)0x4006C015 // UART FIFO Receive Watermark
#define UART2_RCFIFO            *(volatile uint8_t  *)0x4006C016 // UART FIFO Receive Count
#define UART2_C7816             *(volatile uint8_t  *)0x4006C018 // UART 7816 Control Register
#define UART2_IE7816            *(volatile uint8_t  *)0x4006C019 // UART 7816 Interrupt Enable Register
#define UART2_IS7816            *(volatile uint8_t  *)0x4006C01A // UART 7816 Interrupt Status Register
#define UART2_WP7816T0          *(volatile uint8_t  *)0x4006C01B // UART 7816 Wait Parameter Register
#define UART2_WP7816T1          *(volatile uint8_t  *)0x4006C01B // UART 7816 Wait Parameter Register
#define UART2_WN7816            *(volatile uint8_t  *)0x4006C01C // UART 7816 Wait N Register
#define UART2_WF7816            *(volatile uint8_t  *)0x4006C01D // UART 7816 Wait FD Register
#define UART2_ET7816            *(volatile uint8_t  *)0x4006C01E // UART 7816 Error Threshold Register
#define UART2_TL7816            *(volatile uint8_t  *)0x4006C01F // UART 7816 Transmit Length Register
#define UART2_C6                *(volatile uint8_t  *)0x4006C021 // UART CEA709.1-B Control Register 6
#define UART2_PCTH              *(volatile uint8_t  *)0x4006C022 // UART CEA709.1-B Packet Cycle Time Counter High
#define UART2_PCTL              *(volatile uint8_t  *)0x4006C023 // UART CEA709.1-B Packet Cycle Time Counter Low
#define UART2_B1T               *(volatile uint8_t  *)0x4006C024 // UART CEA709.1-B Beta1 Timer
#define UART2_SDTH              *(volatile uint8_t  *)0x4006C025 // UART CEA709.1-B Secondary Delay Timer High
#define UART2_SDTL              *(volatile uint8_t  *)0x4006C026 // UART CEA709.1-B Secondary Delay Timer Low
#define UART2_PRE               *(volatile uint8_t  *)0x4006C027 // UART CEA709.1-B Preamble
#define UART2_TPL               *(volatile uint8_t  *)0x4006C028 // UART CEA709.1-B Transmit Packet Length
#define UART2_IE                *(volatile uint8_t  *)0x4006C029 // UART CEA709.1-B Interrupt Enable Register
#define UART2_WB                *(volatile uint8_t  *)0x4006C02A // UART CEA709.1-B WBASE
#define UART2_S3                *(volatile uint8_t  *)0x4006C02B // UART CEA709.1-B Status Register
#define UART2_S4                *(volatile uint8_t  *)0x4006C02C // UART CEA709.1-B Status Register
#define UART2_RPL               *(volatile uint8_t  *)0x4006C02D // UART CEA709.1-B Received Packet Length
#define UART2_RPREL             *(volatile uint8_t  *)0x4006C02E // UART CEA709.1-B Received Preamble Length
#define UART2_CPW               *(volatile uint8_t  *)0x4006C02F // UART CEA709.1-B Collision Pulse Width
#define UART2_RIDT              *(volatile uint8_t  *)0x4006C030 // UART CEA709.1-B Receive Indeterminate Time
#define UART2_TIDT              *(volatile uint8_t  *)0x4006C031 // UART CEA709.1-B Transmit Indeterminate Time

