Blinkinlabs/EightByEight/bootloader/mk20dn64.h
// Chapter 45: Synchronous Audio Interface (SAI)
#define I2S0_TCSR               *(volatile uint32_t *)0x4002F000 // SAI Transmit Control Register
#define I2S0_TCR1               *(volatile uint32_t *)0x4002F004 // SAI Transmit Configuration 1 Register
#define I2S0_TCR2               *(volatile uint32_t *)0x4002F008 // SAI Transmit Configuration 2 Register
#define I2S0_TCR3               *(volatile uint32_t *)0x4002F00C // SAI Transmit Configuration 3 Register
#define I2S0_TCR4               *(volatile uint32_t *)0x4002F010 // SAI Transmit Configuration 4 Register
#define I2S0_TCR5               *(volatile uint32_t *)0x4002F014 // SAI Transmit Configuration 5 Register
#define I2S0_TDR0               *(volatile uint32_t *)0x4002F020 // SAI Transmit Data Register
#define I2S0_TFR0               *(volatile uint32_t *)0x4002F040 // SAI Transmit FIFO Register
#define I2S0_TMR                *(volatile uint32_t *)0x4002F060 // SAI Transmit Mask Register
#define I2S0_RCSR               *(volatile uint32_t *)0x4002F080 // SAI Receive Control Register
#define I2S0_RCR1               *(volatile uint32_t *)0x4002F084 // SAI Receive Configuration 1 Register
#define I2S0_RCR2               *(volatile uint32_t *)0x4002F088 // SAI Receive Configuration 2 Register
#define I2S0_RCR3               *(volatile uint32_t *)0x4002F08C // SAI Receive Configuration 3 Register
#define I2S0_RCR4               *(volatile uint32_t *)0x4002F090 // SAI Receive Configuration 4 Register
#define I2S0_RCR5               *(volatile uint32_t *)0x4002F094 // SAI Receive Configuration 5 Register
#define I2S0_RDR0               *(volatile uint32_t *)0x4002F0A0 // SAI Receive Data Register
#define I2S0_RFR0               *(volatile uint32_t *)0x4002F0C0 // SAI Receive FIFO Register
#define I2S0_RMR                *(volatile uint32_t *)0x4002F0E0 // SAI Receive Mask Register
#define I2S0_MCR                *(volatile uint32_t *)0x4002F100 // SAI MCLK Control Register
#define I2S0_MDR                *(volatile uint32_t *)0x4002F104 // SAI MCLK Divide Register

// Chapter 46: General-Purpose Input/Output (GPIO)
#define GPIOA_PDOR              *(volatile uint32_t *)0x400FF000 // Port Data Output Register
#define GPIOA_PSOR              *(volatile uint32_t *)0x400FF004 // Port Set Output Register
#define GPIOA_PCOR              *(volatile uint32_t *)0x400FF008 // Port Clear Output Register
#define GPIOA_PTOR              *(volatile uint32_t *)0x400FF00C // Port Toggle Output Register
#define GPIOA_PDIR              *(volatile uint32_t *)0x400FF010 // Port Data Input Register
#define GPIOA_PDDR              *(volatile uint32_t *)0x400FF014 // Port Data Direction Register
#define GPIOB_PDOR              *(volatile uint32_t *)0x400FF040 // Port Data Output Register
#define GPIOB_PSOR              *(volatile uint32_t *)0x400FF044 // Port Set Output Register
#define GPIOB_PCOR              *(volatile uint32_t *)0x400FF048 // Port Clear Output Register
#define GPIOB_PTOR              *(volatile uint32_t *)0x400FF04C // Port Toggle Output Register
#define GPIOB_PDIR              *(volatile uint32_t *)0x400FF050 // Port Data Input Register
#define GPIOB_PDDR              *(volatile uint32_t *)0x400FF054 // Port Data Direction Register
#define GPIOC_PDOR              *(volatile uint32_t *)0x400FF080 // Port Data Output Register
#define GPIOC_PSOR              *(volatile uint32_t *)0x400FF084 // Port Set Output Register
#define GPIOC_PCOR              *(volatile uint32_t *)0x400FF088 // Port Clear Output Register
#define GPIOC_PTOR              *(volatile uint32_t *)0x400FF08C // Port Toggle Output Register
#define GPIOC_PDIR              *(volatile uint32_t *)0x400FF090 // Port Data Input Register
#define GPIOC_PDDR              *(volatile uint32_t *)0x400FF094 // Port Data Direction Register
#define GPIOD_PDOR              *(volatile uint32_t *)0x400FF0C0 // Port Data Output Register
#define GPIOD_PSOR              *(volatile uint32_t *)0x400FF0C4 // Port Set Output Register
#define GPIOD_PCOR              *(volatile uint32_t *)0x400FF0C8 // Port Clear Output Register
#define GPIOD_PTOR              *(volatile uint32_t *)0x400FF0CC // Port Toggle Output Register
#define GPIOD_PDIR              *(volatile uint32_t *)0x400FF0D0 // Port Data Input Register
#define GPIOD_PDDR              *(volatile uint32_t *)0x400FF0D4 // Port Data Direction Register
#define GPIOE_PDOR              *(volatile uint32_t *)0x400FF100 // Port Data Output Register
#define GPIOE_PSOR              *(volatile uint32_t *)0x400FF104 // Port Set Output Register
#define GPIOE_PCOR              *(volatile uint32_t *)0x400FF108 // Port Clear Output Register
#define GPIOE_PTOR              *(volatile uint32_t *)0x400FF10C // Port Toggle Output Register
#define GPIOE_PDIR              *(volatile uint32_t *)0x400FF110 // Port Data Input Register
#define GPIOE_PDDR              *(volatile uint32_t *)0x400FF114 // Port Data Direction Register

// Chapter 47: Touch sense input (TSI)
#define TSI0_GENCS              *(volatile uint32_t *)0x40045000 // General Control and Status Register
#define TSI_GENCS_LPCLKS        (uint32_t)0x10000000        // 
#define TSI_GENCS_LPSCNITV(n)       (((n) & 15) << 24)      // 
#define TSI_GENCS_NSCN(n)       (((n) & 31) << 19)      // 
#define TSI_GENCS_PS(n)         (((n) & 7) << 16)       // 
#define TSI_GENCS_EOSF          (uint32_t)0x00008000        // 
#define TSI_GENCS_OUTRGF        (uint32_t)0x00004000        // 
#define TSI_GENCS_EXTERF        (uint32_t)0x00002000        // 
#define TSI_GENCS_OVRF          (uint32_t)0x00001000        // 
#define TSI_GENCS_SCNIP         (uint32_t)0x00000200        // 
#define TSI_GENCS_SWTS          (uint32_t)0x00000100        // 
#define TSI_GENCS_TSIEN         (uint32_t)0x00000080        // 
#define TSI_GENCS_TSIIE         (uint32_t)0x00000040        // 
#define TSI_GENCS_ERIE          (uint32_t)0x00000020        // 
#define TSI_GENCS_ESOR          (uint32_t)0x00000010        // 
#define TSI_GENCS_STM           (uint32_t)0x00000002        // 
#define TSI_GENCS_STPE          (uint32_t)0x00000001        // 
#define TSI0_SCANC              *(volatile uint32_t *)0x40045004 // SCAN Control Register
#define TSI_SCANC_REFCHRG(n)        (((n) & 15) << 24)      // 
#define TSI_SCANC_EXTCHRG(n)        (((n) & 7) << 16)       // 
#define TSI_SCANC_SMOD(n)       (((n) & 255) << 8)      // 
#define TSI_SCANC_AMCLKS(n)     (((n) & 3) << 3)        // 
#define TSI_SCANC_AMPSC(n)      (((n) & 7) << 0)        // 
#define TSI0_PEN                *(volatile uint32_t *)0x40045008 // Pin Enable Register
#define TSI0_WUCNTR             *(volatile uint32_t *)0x4004500C // Wake-Up Channel Counter Register
#define TSI0_CNTR1              *(volatile uint32_t *)0x40045100 // Counter Register
#define TSI0_CNTR3              *(volatile uint32_t *)0x40045104 // Counter Register
#define TSI0_CNTR5              *(volatile uint32_t *)0x40045108 // Counter Register
#define TSI0_CNTR7              *(volatile uint32_t *)0x4004510C // Counter Register
#define TSI0_CNTR9              *(volatile uint32_t *)0x40045110 // Counter Register
#define TSI0_CNTR11             *(volatile uint32_t *)0x40045114 // Counter Register
#define TSI0_CNTR13             *(volatile uint32_t *)0x40045118 // Counter Register
#define TSI0_CNTR15             *(volatile uint32_t *)0x4004511C // Counter Register
#define TSI0_THRESHOLD          *(volatile uint32_t *)0x40045120 // Low Power Channel Threshold Register

// Nested Vectored Interrupt Controller, Table 3-4 & ARMv7 ref, appendix B3.4 (page 750)
#define NVIC_ENABLE_IRQ(n)  (*((volatile uint32_t *)0xE000E100 + (n >> 5)) = (1 << (n & 31)))
#define NVIC_DISABLE_IRQ(n) (*((volatile uint32_t *)0xE000E180 + (n >> 5)) = (1 << (n & 31)))
#define NVIC_SET_PENDING(n) (*((volatile uint32_t *)0xE000E200 + (n >> 5)) = (1 << (n & 31)))
#define NVIC_CLEAR_PENDING(n)   (*((volatile uint32_t *)0xE000E280 + (n >> 5)) = (1 << (n & 31)))

