Blinkinlabs/EightByEight/bootloader/mk20dn64.h
#define NVIC_ISER0      *(volatile uint32_t *)0xE000E100
#define NVIC_ISER1      *(volatile uint32_t *)0xE000E104
#define NVIC_ICER0      *(volatile uint32_t *)0xE000E180
#define NVIC_ICER1      *(volatile uint32_t *)0xE000E184

// 0 = highest priority
// Cortex-M4: 0,16,32,48,64,80,96,112,128,144,160,176,192,208,224,240
// Cortex-M0: 0,64,128,192
#define NVIC_SET_PRIORITY(irqnum, priority)  (*((volatile uint8_t *)0xE000E400 + (irqnum)) = (uint8_t)(priority))
#define NVIC_GET_PRIORITY(irqnum) (*((uint8_t *)0xE000E400 + (irqnum)))

//#define NVIC_SET_PRIORITY(n, p)   
#define IRQ_DMA_CH0     0
#define IRQ_DMA_CH1     1
#define IRQ_DMA_CH2     2
#define IRQ_DMA_CH3     3
#define IRQ_DMA_ERROR       4
#define IRQ_FTFL_COMPLETE   6
#define IRQ_FTFL_COLLISION  7
#define IRQ_LOW_VOLTAGE     8
#define IRQ_LLWU        9
#define IRQ_WDOG        10
#define IRQ_I2C0        11
#define IRQ_SPI0        12
#define IRQ_I2S0_TX     13
#define IRQ_I2S0_RX     14
#define IRQ_UART0_LON       15
#define IRQ_UART0_STATUS    16
#define IRQ_UART0_ERROR     17
#define IRQ_UART1_STATUS    18
#define IRQ_UART1_ERROR     19
#define IRQ_UART2_STATUS    20
#define IRQ_UART2_ERROR     21
#define IRQ_ADC0        22
#define IRQ_CMP0        23
#define IRQ_CMP1        24
#define IRQ_FTM0        25
#define IRQ_FTM1        26
#define IRQ_CMT         27
#define IRQ_RTC_ALARM       28
#define IRQ_RTC_SECOND      29
#define IRQ_PIT_CH0     30
#define IRQ_PIT_CH1     31
#define IRQ_PIT_CH2     32
#define IRQ_PIT_CH3     33
#define IRQ_PDB         34
#define IRQ_USBOTG      35
#define IRQ_USBDCD      36
#define IRQ_TSI         37
#define IRQ_MCG         38
#define IRQ_LPTMR       39
#define IRQ_PORTA       40
#define IRQ_PORTB       41
#define IRQ_PORTC       42
#define IRQ_PORTD       43
#define IRQ_PORTE       44
#define IRQ_SOFTWARE        45


#define __disable_irq() asm volatile("CPSID i");
#define __enable_irq()  asm volatile("CPSIE i");

// System Control Space (SCS), ARMv7 ref manual, B3.2, page 708
#define SCB_CPUID       *(const    uint32_t *)0xE000ED00 // CPUID Base Register
#define SCB_ICSR        *(volatile uint32_t *)0xE000ED04 // Interrupt Control and State
#define SCB_ICSR_PENDSTSET      (uint32_t)0x04000000
#define SCB_VTOR        *(volatile uint32_t *)0xE000ED08 // Vector Table Offset
#define SCB_AIRCR       *(volatile uint32_t *)0xE000ED0C // Application Interrupt and Reset Control
#define SCB_SCR         *(volatile uint32_t *)0xE000ED10 // System Control Register
#define SCB_CCR         *(volatile uint32_t *)0xE000ED14 // Configuration and Control
#define SCB_SHPR1       *(volatile uint32_t *)0xE000ED18 // System Handler Priority Register 1
#define SCB_SHPR2       *(volatile uint32_t *)0xE000ED1C // System Handler Priority Register 2
#define SCB_SHPR3       *(volatile uint32_t *)0xE000ED20 // System Handler Priority Register 3
#define SCB_SHCSR       *(volatile uint32_t *)0xE000ED24 // System Handler Control and State
#define SCB_CFSR        *(volatile uint32_t *)0xE000ED28 // Configurable Fault Status Register
#define SCB_HFSR        *(volatile uint32_t *)0xE000ED2C // HardFault Status
#define SCB_DFSR        *(volatile uint32_t *)0xE000ED30 // Debug Fault Status
#define SCB_MMFAR       *(volatile uint32_t *)0xE000ED34 // MemManage Fault Address

#define SYST_CSR        *(volatile uint32_t *)0xE000E010 // SysTick Control and Status
#define SYST_CSR_COUNTFLAG      (uint32_t)0x00010000
#define SYST_CSR_CLKSOURCE      (uint32_t)0x00000004
#define SYST_CSR_TICKINT        (uint32_t)0x00000002
#define SYST_CSR_ENABLE         (uint32_t)0x00000001
#define SYST_RVR        *(volatile uint32_t *)0xE000E014 // SysTick Reload Value Register
#define SYST_CVR        *(volatile uint32_t *)0xE000E018 // SysTick Current Value Register
#define SYST_CALIB      *(const    uint32_t *)0xE000E01C // SysTick Calibration Value


#define ARM_DEMCR               *(volatile uint32_t *)0xE000EDFC // Debug Exception and Monitor Control
#define ARM_DEMCR_TRCENA        (1 << 24)        // Enable debugging & monitoring blocks
#define ARM_DWT_CTRL            *(volatile uint32_t *)0xE0001000 // DWT control register
#define ARM_DWT_CTRL_CYCCNTENA          (1 << 0)                // Enable cycle count
#define ARM_DWT_CYCCNT          *(volatile uint32_t *)0xE0001004 // Cycle count register


extern void nmi_isr(void);
extern void hard_fault_isr(void);
extern void memmanage_fault_isr(void);
extern void bus_fault_isr(void);
extern void usage_fault_isr(void);
extern void svcall_isr(void);
extern void debugmonitor_isr(void);
extern void pendablesrvreq_isr(void);
extern void systick_isr(void);
extern void dma_ch0_isr(void);
extern void dma_ch1_isr(void);
extern void dma_ch2_isr(void);
extern void dma_ch3_isr(void);
extern void dma_error_isr(void);
extern void flash_cmd_isr(void);
extern void flash_error_isr(void);
extern void low_voltage_isr(void);
extern void wakeup_isr(void);
extern void watchdog_isr(void);
extern void i2c0_isr(void);
extern void spi0_isr(void);
extern void i2s0_tx_isr(void);
extern void i2s0_rx_isr(void);
extern void uart0_lon_isr(void);
extern void uart0_status_isr(void);
extern void uart0_error_isr(void);
extern void uart1_status_isr(void);
extern void uart1_error_isr(void);
extern void uart2_status_isr(void);
extern void uart2_error_isr(void);
extern void adc0_isr(void);
extern void cmp0_isr(void);
extern void cmp1_isr(void);
extern void ftm0_isr(void);
extern void ftm1_isr(void);
extern void cmt_isr(void);
extern void rtc_alarm_isr(void);
extern void rtc_seconds_isr(void);
extern void pit0_isr(void);
extern void pit1_isr(void);
extern void pit2_isr(void);
extern void pit3_isr(void);
extern void pdb_isr(void);
extern void usb_isr(void);
extern void usb_charge_isr(void);
extern void tsi0_isr(void);
extern void mcg_isr(void);
extern void lptmr_isr(void);
extern void porta_isr(void);
extern void portb_isr(void);
extern void portc_isr(void);
extern void portd_isr(void);
extern void porte_isr(void);
extern void software_isr(void);

static inline void watchdog_refresh(void)
{
	__disable_irq();
	WDOG_REFRESH = 0xA602;
	WDOG_REFRESH = 0xB480;
	__enable_irq();
}

static inline void watchdog_reboot(void)
{
	// Any invalid write to the WDOG registers will trigger an immediate reboot
	WDOG_REFRESH = 0;
}


#ifdef __cplusplus
}
#endif
#endif
